In [14]:
import numpy as np
import pandas as pd

In [15]:
data_one = {'A': ['A0', 'A1', 'A2', 'A3'], 'B':['B0', 'B1', 'B2', 'B3']}
data_two = {'C': ['C0', 'C1', 'C2', 'C3'], 'D':['D0', 'D1', 'D2', 'D3']}

In [16]:
one = pd.DataFrame(data_one)
two = pd.DataFrame(data_two)

In [17]:
one

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [18]:
two

    C   D
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [19]:
# concatnate along the columns
pd.concat([one, two], axis=1)       # combing(pasting) the column together

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [20]:
# concatnate along the rows
pd.concat([one, two], axis=0)
# the NaN values tells us this was not a good idea to join those two together

     A    B    C    D
0   A0   B0  NaN  NaN
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3   A3   B3  NaN  NaN
0  NaN  NaN   C0   D0
1  NaN  NaN   C1   D1
2  NaN  NaN   C2   D2
3  NaN  NaN   C3   D3

In [21]:
# let's say I know that C and D are basically the same feature as A and B respectively
two.columns = one.columns

In [22]:
my_df = pd.concat([one, two], axis=0)

In [23]:
my_df
my_df.index = range(len(my_df))             # reset the index of the dataframe
my_df.index     
my_df

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
4  C0  D0
5  C1  D1
6  C2  D2
7  C3  D3

### II. Inner Merge

#### The .merge() method takes in a key argument labeled how
#### There are 3 main ways of merging tables together using the how parameter:
        * Inner
        * Outer
        * Left or Right

#### * Let's imagine a simple example
#### * Our company is holding a conference for people in the movie rental industry
#### * We'll have people register online beforehand and then login the day of the conference

<img src="/home/ziya/Documents/data_science/pandas/tale.png" width="600" height="400">

#### Two problem are shown here
        * Not everyone came was registered
        * Not everyone registered came

#### For the sake of simplicity we assume names are unique

##### * Firs we need to decide "on" what column to merge together
        -> The "on" column should be a primary identifier, meaning unique per row
        -> The "on" column should be present in both tables being merged

#### Since we assume names are unique here, we will merge on="name"

#### -> Next we need to decide how to merge tables on the name column
        with how="inner" the result will be the set of records that match in both tables
<img src="/home/ziya/Documents/data_science/pandas/table_2.png" width="800" height="400">

#### Merges are often shown as Venn diagram
     pd.merge(registrations, logins, how='inner', on='name')
<img src="/home/ziya/Documents/data_science/pandas/table_3.png" width="1200" height="400">

#### Result
<img src="/home/ziya/Documents/data_science/pandas/table_4.png" width="1200" height="400">

In [28]:
registrations = pd.DataFrame({'reg_id':[1,2,3,4],'name':['Andrew','Bobo','Claire','David']})
logins = pd.DataFrame({'log_id':[1,2,3,4],'name':['Xavier','Andrew','Yolanda','Bobo']})

In [29]:
registrations

   reg_id    name
0       1  Andrew
1       2    Bobo
2       3  Claire
3       4   David

In [31]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

In [34]:
#help(pd.merge)

In [36]:
pd.merge(registrations, logins, how='inner', on='name')         # remember the on column must be unique, and how is the method of merging

   reg_id    name  log_id
0       1  Andrew       2
1       2    Bobo       4